# 创建列表，通过[]来创建列表
my_list =[]#创建了一个列表
# print(my_list,type(my_list))
# 列表存储的数据，我们称为元素
# 一个列表中可以存储多个元素，也可以在创建列表时，来指定列表中的元素
my_list = [10] #创建一个只包含一个元素的列表

# 当想列表中添加多个元素，多个元素之间使用，隔开
my_list = [10,20,30,40,50] #创建了一个保护有五个元素的列表

# 列表中可以保存任意的对象
my_list = [10,'hello',True,None,[1,2,3],print]

# 列表中的对象都会安装插入的顺序存储到列表中，第一个插入的对象保存到第一个为， 第二个保存到第二个位置
# 我们可以动过索引(index)来获取列表中的元素
#   索引是元素在列表中的位置，列表中每一个元素都有一个索引
#   索引是从0开始的整数，列表第一个位置索引为0，第二个位置索引为1，第三个位置索引为2，以此类推

my_list = [10,20,30,40,50]

# 通过索引获取列表中的元素
# 语法：my_list[索引]

# print(my_list[4])
# 如果使用的索引超过了最大的范围，会抛出异常
# print(my_list[5]) IndexError: list index out of range

# 获取列表的长度，列表中的元素的个数
# len()函数，通过函数可以获取列表的长度
# 获取到的长度的值，是列表的最大索引 + 1

# print(len(my_list))



    # -练习：
    #     -创建一个列表，在列表中保存你最好的五个朋友的名字
    #         然后分别通过索引来获取每个朋友的名字

my_list = ['tiz','tt','ll','cc','zz']
print(len(my_list),my_list[0])
