# 创建一个列表
stus = ['孙悟空','猪八戒','沙和尚','唐僧','制造机','白骨精']

# print("修改前",stus)
# 修改列表中元素
# 直接通过索引来修改元素
stus[0] = 'sunwukong'
stus[2] = '哈哈'
# 通过del来删除元素
del stus[2] #删除索引为2的元素

# print('修改后:',stus)
stus = ['孙悟空','猪八戒','沙和尚','唐僧','制造机','白骨精']

print("修改前:",stus)

# 通过切片来修改
# 在给切片进行赋值时，只能使用序列

# stus[0:2] = ['牛魔王','红孩儿']
# stus[0:2] = ['牛魔王','红孩儿','二郎神']
# stus[0:0] = ['牛魔王','红孩儿','二郎神']
# stus[0:0] = ['牛魔王'] # 向引索为0的位置插入元素
# stus[::2] = ['牛魔王','红孩儿','二郎神']

# 通过切片来删除元素
# del stus[0:2]
# del stus[::2]
# stus[1:3] = []


# print("修改后:",stus)
# 以上操作，只适用于可变序列

s = 'hello'
# s[1] = 'a' 不可变序列，无法通过索引来
# 可以通过list()函数将其他的序列转换为list

s = list(s)
print(s)