# 小游戏 《唐僧大战白骨精》
    1,身份选择
        ①显示提示信息
            欢迎光临 xxx 游戏！
            请选择你的身份
                1.xxx
                2.xxx
            请选择: x
        ②根据用户选择来分配身份(显示不同的天使信息)
            1. ---
            2. ---
            3. ---
    2,游戏进行
        ① 显示玩家的基本信息(攻击力 生命值)
        ② 显示玩家可以进行的操作：
            1，练级
                - 提升玩家的攻击力和生命值
            2，打BOSs
                - 玩家对BOSS进行攻击，玩家要攻击BOSS，BOSS对玩家进行反击
                -计算BOSS是否呗玩家消灭，玩家是否被BOSS消灭
                - 游戏结束
            3，逃跑
                -退出游戏，显示提示信息，游戏结束！